БухЭксп/Enums/CW_РеестрыНДС0ПризнакСтрокиПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РеестрыНДС0ПризнакСтрокиПриложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяСтрока</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяСтрока</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_РеестрыНДС0СоответствиеЗаполненияСтрок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_РеестрыНДС0СоответствиеЗаполненияСтрок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПриказа</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0ПризнакСтрокиПриложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиСтрок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЯчейкаОтчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЯчейки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РеестрыНДС0АлгоритмыЗаполненияЯчеекОтчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСтроки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СоответствияЗаполненияСтрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РеестрыНДС0СоответствиеЗаполненияСтрок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonForms/CW_РеестрыНДС0КонтрольЗаполнения/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрКоманды = Новый ФиксированныйМассив(Параметры.ПараметрКоманды);
	
	Если Параметры.Свойство("СписокРеестров") Тогда
		ЗаполнитьДанныеФормы(Параметры.СписокРеестров );
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Обновить(Команда)

	ОбновитьТаблицуРеестровНаСервере();   
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуРеестровНаСервере()

	СписокРеестровНДС = CW_РеестрыНДС0СерверВызовСервера.ПодготовитьДанныеЗаписиРеестраНДСНаСервере(ПараметрКоманды, ПоказатьТолькоСОшибкамиЗаполнения);  
	ЗаполнитьДанныеФормы(СписокРеестровНДС);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы(СписокРеестровНДС)
	
	ДеревоРеестров = РеквизитФормыВЗначение("ТаблицаРеестров");
	ДеревоРеестров.Очистить();
	
	Для Каждого ДанныеРеестра из СписокРеестровНДС Цикл  
		
		Если ДанныеРеестра.ВсегоСтрок = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДеревоРеестров.Добавить();
		НоваяСтрока.Заголовок 		=  ДанныеРеестра.Заголовок;
		НоваяСтрока.ИндексКартинки 	= 1;
		НоваяСтрока.Адрес 			=  ПоместитьВоВременноеХранилище(ДанныеРеестра.ТабличныйДокумент, Новый УникальныйИдентификатор);
		
		//Для расшифровки ячейки
		НоваяСтрока.Приказ 				= ДанныеРеестра.Приказ;
		НоваяСтрока.ПриложениеПриказа 	= ДанныеРеестра.ПриложениеПриказа;
		НоваяСтрока.ВидТранспорта 		= ДанныеРеестра.ВидТранспорта;   
		НоваяСтрока.ВсегоСтрок 			= ДанныеРеестра.ВсегоСтрок;   
		НоваяСтрока.ВсегоОшибок 		= ДанныеРеестра.ВсегоОшибок;   
		
	КонецЦикла;

	ЗначениеВРеквизитФормы(ДеревоРеестров, "ТаблицаРеестров");
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеестровПриАктивизацииСтроки(Элемент)

	ПодключитьОбработчикОжидания("УстановитьТабличныйДокумент", 0.1, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТабличныйДокумент()
	
	ТекущаяСтрока = Элементы.ТаблицаРеестров.ТекущаяСтрока;   
	ТаблицаРеестровПриАктивизацииСтрокиНаСервере(ТекущаяСтрока);
	
КонецПроцедуры  

&НаСервере
Процедура ТаблицаРеестровПриАктивизацииСтрокиНаСервере(ТекущаяСтрока)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТабличныйДокумент = новый ТабличныйДокумент;
		Возврат;
	КонецЕсли;
	
	СтрокаТекущая = ТаблицаРеестров.НайтиПоИдентификатору(ТекущаяСтрока); 
	Если СтрокаТекущая = Неопределено Тогда 
		ТабличныйДокумент = новый ТабличныйДокумент;
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент =	 ПолучитьИзВременногоХранилища(СтрокаТекущая.Адрес);
		
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьЯчейку(Команда)

	ТекущаяОбласть 	= Элементы.ТабличныйДокумент.ТекущаяОбласть;
	
	ТекущаяСтрокаРеестра = Элементы.ТаблицаРеестров.ТекущаяСтрока;
	
	АлгоритмЗаполения = ПолучитьАлгоритмЗаполненияНаСервере(ТекущаяСтрокаРеестра, ТекущаяОбласть.Имя);  
	
	Если АлгоритмЗаполения <> Неопределено Тогда
		ПоказатьЗначение(,АлгоритмЗаполения);       
	КонецЕсли;
	
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьАлгоритмЗаполненияНаСервере(ТекущаяСтрока, ИмяОбласти)
	
	ИмяЯчейки		= Лев(ИмяОбласти, 8);   
	СтрокаТекущая 	= ТаблицаРеестров.НайтиПоИдентификатору(ТекущаяСтрока);  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_РеестрыНДС0ЯчейкиПриложений.ИмяЯчейки КАК ИмяЯчейки,
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	               |ГДЕ
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Ссылка В ИЕРАРХИИ(&ПриложениеПриказа)
	               |	И CW_РеестрыНДС0ЯчейкиПриложений.ИмяЯчейки = &ИмяЯчейки"; 
	
	Запрос.УстановитьПараметр("ПриложениеПриказа", 	СтрокаТекущая.ПриложениеПриказа);
	Запрос.УстановитьПараметр("ИмяЯчейки", 			ИмяЯчейки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда  
		ЯчейкаОтчета = Выборка.Ссылка;
	КонецЕсли;
	
	Если ЯчейкаОтчета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрыНДС0СоответствиеЗаполненияСтрокНастройкиСтрок.Ссылка.ПризнакСтроки КАК ПризнакСтроки,
	               |	CW_РеестрыНДС0СоответствиеЗаполненияСтрокНастройкиСтрок.ЯчейкаОтчета КАК ЯчейкаОтчета,
	               |	CW_РеестрыНДС0СоответствиеЗаполненияСтрокНастройкиСтрок.ЗначениеЯчейки КАК ЗначениеЯчейки
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0СоответствиеЗаполненияСтрок.НастройкиСтрок КАК CW_РеестрыНДС0СоответствиеЗаполненияСтрокНастройкиСтрок
	               |ГДЕ
	               |	CW_РеестрыНДС0СоответствиеЗаполненияСтрокНастройкиСтрок.Ссылка.Приказ = &Приказ
	               |	И CW_РеестрыНДС0СоответствиеЗаполненияСтрокНастройкиСтрок.Ссылка.ПриложениеПриказа = &ПриложениеПриказа
	               |	И CW_РеестрыНДС0СоответствиеЗаполненияСтрокНастройкиСтрок.Ссылка.Приложение = &Приложение
	               |	И CW_РеестрыНДС0СоответствиеЗаполненияСтрокНастройкиСтрок.ЯчейкаОтчета = &ЯчейкаОтчета";  
	
	Запрос.УстановитьПараметр("Приказ", 			СтрокаТекущая.Приказ);
	Запрос.УстановитьПараметр("ПриложениеПриказа", 	СтрокаТекущая.ПриложениеПриказа);
	Запрос.УстановитьПараметр("Приложение", 		СтрокаТекущая.ВидТранспорта);
	Запрос.УстановитьПараметр("ЯчейкаОтчета", 		ЯчейкаОтчета); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПризнакСтроки	= ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0ПризнакСтрокиПриложения.ОсновнаяСтрока") Тогда
			ОсновнаяСтрока = Выборка.ЗначениеЯчейки;	
		КонецЕсли;
		Если Выборка.ПризнакСтроки	= ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0ПризнакСтрокиПриложения.ДополнительнаяСтрока") Тогда
			ДополнительнаяСтрока = Выборка.ЗначениеЯчейки;	
		КонецЕсли;
	КонецЦикла;     
	
	Если ДополнительнаяСтрока <> Неопределено Тогда
		
		КооринатыОбласти = СтрЗаменить(ИмяОбласти, ИмяЯчейки, "");   
		
		Если СтрокаТекущая.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение10") Тогда
			ИмяОбластиВидДокумента	= "П1100002"+КооринатыОбласти;   
			ОбластьВидДокумента 	= ТабличныйДокумент.Область(ИмяОбластиВидДокумента); 
			ВидДокумента 			= ОбластьВидДокумента.Значение;  
			
			ЭтоДополнительнаяСтрока = (ВидДокумента = "06");   
			Если ЭтоДополнительнаяСтрока Тогда
				Возврат ДополнительнаяСтрока;     
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ОсновнаяСтрока;	
	
КонецФункции
